In [1]:
#Numpy
import numpy as np
#Pandas
import pandas as pd

In [2]:
# Basics CSV
filename = 'Data/title_basics.csv.gz'
basics = pd.read_csv(filename)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

# 1. Getting a List of Unique Genres

In [3]:
# split the genres on the comma
basics['genres_split'] = basics['genres'].str.split(',')

In [4]:
# explose the new column
exploded = basics.explode('genres_split')

In [5]:
# sort them by unique values
genres = sorted(exploded['genres_split'].unique())
genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

# 2. Create a new title_genres table

In [6]:
# save IDs and genres ina new df
title_genres = exploded[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

# 3. Create a genre mapper dictionary to replace string genres with integers

In [7]:
## Making the genre mapper dictionary
genres_ints = range(len(genres))
genres_map = dict(zip(genres, genres_ints))
genres_map
#assigning a number to each genre

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

# 4. Replace the string genres in title_genres with the new integer ids.

In [8]:
## make new integer genre_id
title_genres['genre_id'] = title_genres['genres_split'].map(genres_map)
#drop string genres
title_genres = title_genres.drop(columns='genres_split')

# 5. Convert the genre map dictionary into a dataframe.

In [9]:
# what is happening here?
genres_lookup = pd.DataFrame({'genre_name': genres_map.keys(),
                             'genre_id': genres_map.values()})

genres_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Discard unnecessary information:

For the title basics table, drop the following columns:
- "original_title" (we will use the primary title column instead)
- "isAdult" ("Adult" will show up in the genres so this is redundant information).
- "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [10]:
# Drop the unnecessary columns
basics = basics.drop(columns=['originalTitle','isAdult', 'titleType', 'genres', 'genres_split'])
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122
4,tt0088751,The Naked Monster,2005.0,NaN,100

# Imports and Login for MySQL

In [11]:
import json
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

#Sign into MySQL

with open('/Users/kristinadibella/.secret/mysql.json') as f: 
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [12]:
# create connection for database called movies
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)

In [13]:
# check exists or created
if database_exists(connection):
    print('It Exists')
else:
    create_database(connection)
    print('Database Created')

It Exists

## Load in Ratings DF and TMBD DF

In [14]:
# load in ratings CSV
filename = 'Data/title_ratings.csv.gz'
ratings = pd.read_csv(filename)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [15]:
# load in TMDB CSV
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

In [16]:
tmdb_final = tmdb[['imdb_id', 'budget', 'revenue', 'certification']]
tmdb_final.head(2)

     imdb_id      budget  revenue certification
0          0         NaN      NaN           NaN
1  tt0113026  10000000.0      0.0           NaN

# 1. Creating a dataype schema for to_sql:

In [17]:
# check data types
basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
endYear           float64
runtimeMinutes      int64
dtype: object

In [18]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [19]:
tmdb_final.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [20]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [21]:
genres_lookup.dtypes

genre_name    object
genre_id       int64
dtype: object

In [22]:
## Example
from sqlalchemy.types import *

## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
rating_key_len = ratings['tconst'].fillna('').map(len).max()
tmdb_key_len = tmdb_final['imdb_id'].fillna('').map(len).max()
certification_len = tmdb_final['certification'].fillna('').map(len).max()
title_genres_key_len = title_genres['tconst'].fillna('').map(len).max()
genres_name_len = genres_lookup['genre_name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1),"primaryTitle": Text(title_len+1),
    'startYear':Float(),'endYear':Float(),'runtimeMinutes':Integer(),
    #ratings
    'tconst': String(rating_key_len+1), 'averageRating': Float(), 'numVotes': Integer(),
    #imdb
    'imdb_id': String(tmdb_key_len+1) , 'budget' :Float(), 'revenue' :Float(), 
    'certification':Text(certification_len+1),
    #title_genres
    'tconst': String(title_genres_key_len+1), 'genre_id': Integer(), 
    #genres_lookup
    'genre_name':Text(genres_name_len+1), 'genre_id':Integer()}

# 2. Run df.to_sql with the dtype argument.

In [23]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)
#Save ratings to SQL
ratings.to_sql('title_ratings', engine, dtype=df_schema, index = False, if_exists = 'replace')
# Save TMDB to SQL
tmdb.to_sql('tmdb_data', engine, dtype=df_schema, index = False, if_exists = 'replace')
# Save genres_lookup to SQL
genres_lookup.to_sql('genres', engine, dtype=df_schema, index = False, if_exists = 'replace')
# Save genres_lookup to SQL
title_genres.to_sql('title_genres', engine, dtype=df_schema, index = False, if_exists = 'replace')

162403

# 3. Run the query to ADD PRIMARY KEY

In [24]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);') 
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [25]:
# first 5 of table
q = """
SELECT *
FROM title_basics
LIMIT 5
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100

In [26]:
# first 5 of table
q = """
SELECT *
FROM title_ratings
LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [27]:
# first 5 of table
q = """
SELECT *
FROM tmdb_data
LIMIT 5
;"""
pd.read_sql(q, engine)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,None,None,NaN,None,None,NaN,None,None,...,NaN,NaN,None,None,None,None,NaN,NaN,NaN,None
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,None,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",None,11232.0,en,Kate & Leopold,...,76019000.0,118.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.328,1200.0,PG-13
2,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,None,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",None,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,None
3,tt0113092,0.0,None,None,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",None,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,None
4,tt0114447,0.0,None,None,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",None,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,None

In [28]:
# first 5 of table
q = """
SELECT *
FROM title_genres
LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11

In [29]:
# first 5 of table
q = """
SELECT *
FROM genres
LIMIT 5
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [30]:
# Test the database/ show tables
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data